Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: Open Compliance Data Sheet
ja: オープン コンプライアンス データ シート (英語)

source: Toolchains are maintained within the OBS repository like any other Package.
ja: ツールチェーンは、他のパッケージと同じように、OBS リポジトリ内でメンテナンスされます。

source: Compliance Tools
ja: コンプライアンス ツール

source: The scope of the problem
ja: 問題のスコープ

source: INDIVIDUALS AND TEAMS INVOLVED IN FOSS COMPLIANCE
ja: FOSS コンプライアンスに関わる人々とチーム

source: Taking steps in this direction, combined with open and honest relationship, is a great asset to have and maintain especially in the event that a company get into a compliance "oops".
ja: オープンで誠実な関係で結ばれ、そのような良い方向に進むことは、特に企業がコンプライアンス問題で失敗したときのために保持しておくべき偉大な資産です。

source: Gaining a technical advantage since compliant stacks are easier to service, upgrade, and test
ja: コンプライアンスを徹底したソフトウェア スタックは、サービス実施、アップグレード、およびテストが簡単なため、技術的な利点が得られる

source: The Open Source Compliance training course will be available starting September 1, 2010.
ja: オープン ソース コンプライアンス コースは、2010 年 9 月 1 日開始予定です。

source: We will have a separate paper that discusses policies and processes invoked when FOSS is included in a commercial product, in addition to a detailed discussion around the compliance end-to-end process.
ja: 商品に FOSS を組み込む際に必要なポリシーとプロセス、およびコンプライアンス プロセスの詳細については、別のホワイトペーパーで説明します。

source: Building an entire operating system such as a Linux distribution may possibly one of the most demanding tasks that a build system has to execute.
ja: Linux ディストリビューションなどの OS 全体のビルドは、ビルド システムが実行しなければならない最も厳しい作業に分類されるでしょう。

source: Conclusion
ja: まとめ

source: If the build of the Package or a depending package fails then the developer is notified.
ja: パッケージや依存パッケージのビルドが失敗した場合は、開発者に通知されます。

source: Like any other open source project, the project is open (open mailing list, open git repository, open bugzilla) and governed by open source development processes.
ja: 他のオープン ソース プロジェクトと同様に、このプロジェクトもオープンであり (オープンなメーリング リスト、オープンな git リポジトリ、オープンなバグ登録システムである bugzilla などを使用)、オープン ソース開発プロセスによって管理されています。

source: They can run their own build service based on OBS.
ja: 彼らは、OBS をベースにした独自のビルド サービスを実行できます。

source: Verification that the packages compile properly.
ja: パッケージが適切にコンパイルできることの検証。

source: This failure occurs when using FOSS in a commercial product and not publishing the FOSS source code and modifications made to it as part of meeting license obligations (for instance when the FOSS is licensed under the GPL).
ja: この違反は、商用製品で FOSS を使用し、そのライセンス条件に FOSS ソース コードとその変更内容を配布することが明記されているにもかかわらず、これらの義務を履行しなかった場合に発生する (たとえば その FOSS が GPL の下でライセンスされている場合)。

source: Estimates of total compliance effort and duration are prepared to address the organization's compliance requirements.
ja: 組織のコンプライアンス要件に対応するために要するコンプライアンス活動の量と期間に関する推定値を用意しておくこと。

source: To sign up, please go to https://spreadsheets.google.com/viewform?hl=en&formkey=dEJzUkRjTWFKbXlqWENHaTFWWFp1MGc6MQ#gid=0.
ja: 登録は、こちらのページからお願いいたします。 https://spreadsheets.google.com/viewform?hl=en&formkey=dEJzUkRjTWFKbXlqWENHaTFWWFp1MGc6MQ#gid=0

source: This is an intensive activity over a period of time that can extend for months depending on how soon you started the compliance activities in parallel to the development activities.
ja: これは一定期間にわたる集中的な活動であり、開発活動と並行してコンプライアンス活動をいつ開始したいかにもよりますが、何カ月にもおよぶ可能性があります。

source: Risks are mitigated through design, engineering practices and compliance
ja: プラットフォームの設計、エンジニアリング プラクティス、およびコンプライアンスによってリスクを低減する

source: It typically requires a 3-step process of Compiling, Packaging, and Imaging to create a final image from source that can be copied to a USB stick or a CD for booting by a computer (Figure 1).
ja: 通常このようなビルドには、コンパイル、パッケージング、イメージングという 3 段階のプロセスが必要です。ソース ファイルから最終イメージを作成し、コンピューターでブート可能な USB メモリや CD にコピーできるようにするためです (図 1)。

source: When you install FOSSology you are only installing the tools to perform your own analyses and create your own software repository.
ja: FOSSology をインストールする場合は、各自の解析を実行するツールのみインストールし、自分のソフトウェア リポジトリを作成してください。

source: Furthermore, the companies whose compliance has been successfully challenged have incurred costs that included:
ja: また、コンプライアンスについて異議を申し立てられた企業には、以下のようなコストが発生します。

source: However, Steven Sinofsky has suggested in his blog posting “Protecting the pre-OS environment with UEFI”: http://blogs.msdn.com/b/b8/archive/2011/09/22/protecting-the-pre-os-environment-with-uefi.aspx that the average platform owner might wish to give up control of the PK (and with it control of the signature database) to Microsoft and the OEM suppliers of the platform.
ja: しかし Steven Sinofsky 氏は、“Protecting the pre-OS environment with UEFI (UEFI で OS 起動前の環境を保護する)” というブログ<http://blogs.msdn.com/b/b8/archive/2011/09/22/protecting-the-pre-os-environment-with-uefi.aspx > で、次のように述べています。「一般的なプラットフォーム オーナーは、Microsoft やプラットフォームの OEM サプライヤーにプラットフォーム鍵の管理 (および署名データベースの管理) を任せたいでしょう。」

source: A facilitated discussion of checklist questions may be fruitful in achieving a consensus view of capability and gaining a perspective on improvement possibilities.
ja: チェックリストに関する議論を促進することは、機能に関する多数の合意見解を得る場合や、改善の可能性について見通しを諮る場合に大変有用です。

source: Communication protocols
ja: 通信プロトコル

source: Estimates of one-time and overhead activities are estimated and tracked
ja: 単発の作業や間接作業の見積もりを算定し、追跡する。

source: In most cases, engineers do not have time to read lengthy licensing text and need a quick summary of most used FOSS licenses that highlights the key points.
ja: 通常、エンジニアには冗長なライセンス文書を読む時間がないため、最もよく使用される FOSS ライセンスの要点を捉えた概略を必要としています。

source: Copyright ownership of the planned contribution is clarified.
ja: 計画されている貢献の著作権のオーナーシップを明確にすること。

source: The Home Page
ja: ホーム ページ

source: Figure 3.
ja: 図 3

source: The establishment of an independent certificate authority for the creation of KEKs would make interoperation easier, but is not necessary for these platforms to support open systems.
ja: 鍵交換鍵を作成するために独立した認証局を設立することは、相互運用を円滑にするためであり、それらのプラットフォームがオープン システムをサポートするために必須なわけではありません。

source: For performance and consistency reasons, the data is organized in a relational database schema stored in a MySQL database server.
ja: パフォーマンスと一貫性を保持するために、MySQL データベースに保存されたリレーショナル データベース スキーマでデータを編成します。

source: - Technical knowledge and depth to be able to discuss with engineers
ja: エンジニアと議論できる技術的知識と教養

source: A request for information regarding use of a specific FOSS project in a product
ja: 製品に含まれている特定の FOSS プロジェクトの使用に関する情報開示の要求

source: For embedded Linux solutions, the complexity scales with the need to support multiple and different processor architectures, hardware platforms with limited resources, requirements for cross toolchains, and more.
ja: 組込み Linux ソリューションについては、複雑さは、複数の異なるプロセッサー アーキテクチャ、限られたリソースを持つハードウェア プラットフォーム、クロス ツールチェーンのための要件などをサポートするためのニーズに対応します。◆

source: We also anticipate the need for tools (e.g. syntax checkers and reading tools) to drive some development.
ja: SPDX データの文法チェックや読み出しツールなどの開発支援ツールも必要でしょう。

source: The mission of the OSRB consists of:
ja: OSRB のミッション

source: Figure 2.
ja: 図 2

source: The next step in the compliance due diligence is to decide on the method and mode of distribution, type of packages to distribute and mechanism of distribution (Figure 11).
ja: コンプライアンス精査の次のステップは、配布の方法とモード、配布するパッケージのタイプ、および配布メカニズムを決定することです (図 11)。

source: The Linux Foundation has just announced a comprehensive program to help organizations meet their compliance responsibilities simply and straightforwardly whenever they incorporate open source in their products.
ja: このたび The Linux Foundation では、企業などが製品にオープン ソースを組み込む際に、無理なくコンプライアンスの責任を果たせるような包括的なプログラムを発表しました。

source: June 2010
ja: 2010 年 7 月

source: A request to provide missing files from the FOSS packages made available as part of meeting the license obligations
ja: ライセンス義務履行の一環として提供された FOSS パッケージから欠落しているファイルの要求

source: Training and Education:
ja: トレーニングと教育:

source: Ten Ways to Get Started in Embedded Linux
ja: 組込み Linux 開発を始めるための 10 の方法

source: - Knowledge and experience in establishing corporate wide programs, policies and processes
ja: 全社的なプログラム、ポリシー、およびプロセス確立に関する知識と経験

source: Besides the obligatory Linux kernel itself with its myriad of configuration options, a working Linux distribution requires hundreds if not thousands of additional packages to form a viable platform for desktop, server, mobile or any other type of specialized applications.
ja: 基本となる Linux カーネルとその大量の設定オプション以外にも、実行中の Linux ディストリビューションは、デスクトップ、サーバー、モバイル、またはその他の特殊アプリケーション タイプ向けの実行可能なプラットフォームを形成する数百から数千のパッケージを必要とします。

source: To enable proper operation with open systems, all UEFI secure boot platforms should ship in setup mode, with no Platform Key installed.
ja: オープン システムで secure boot を問題なく機能させるには、すべての UEFI secure boot プラットフォームが、プラットフォーム鍵のインストールされていない setup モードで出荷される必要があります。

source: Resolution of build-time as well as run-time dependencies on other source and/or binary modules.
ja: 他のソースやバイナリ モジュールと、ビルドタイムやランタイムとの依存関係の解決。

source: The FOSSology installation process involves installing files, configuring a web server (Apache) and starting a database server (PostgreSQL).
ja: FOSSology をインストールするには、ファイルのインストール、Web サーバー (Apache) の構成、およびデータベース サーバー (PostgreSQL) の起動が必要です。

source: The inputs to the BoM difference checker are two BoM files that represent the list of components available on two different version of the product.
ja: BoM 比較ツールには、2 つの BoM ファイルを入力します。これらは、同じ製品の 2 つのバージョンで◆利用可能な◆コンポーネントの各リストです。

source: Training also servers as a venue to publicize and promote the compliance policy and processes with the organization and to promote a culture of compliance.
ja: またトレーニングは、組織のコンプライアンスのポリシーやプロセスを公表および推進し、コンプライアンス文化の普及を促進する場でもあります。

source: - Create new tools based on OSRB request
ja: OSRB の要請に基づいて新しいツールを作成する

source: This paper focuses on the core elements of a compliance process, examining the inputs, actions, and outputs of each element.
ja: このホワイトペーパーでは、コンプライアンス プロセスの中心的要素に注目し、各要素の入力、アクション、出力について分析します。

source: - Compliance Tools: http://www.linuxfoundation.org/programs/legal/compliance/tools
ja: コンプライアンス ツール: http://www.linuxfoundation.jp/programs/legal/compliance/tools

source: The warden process is a watchdog that monitors the activity of the workers.
ja: ウォードン プロセスは、ワーカーの動きを監視するウォッチドッグです。

source: - It moves FOSS use inside the organization from ad-hoc to a standardized process
ja: 組織の FOSS 使用プロセスが、場当たり的なものから標準プロセスに変わる

source: Therefore, it is important to also audit companydeveloped software components since they may include FOSS code, which may lead to compliance failures if not discovered before product ship date.
ja: つまり、自社開発のソフトウェア コンポーネントにも FOSS コードが組み込まれている可能性があり、製品の出荷前にこれらが発見されなければ、コンプライアンス不履行になる恐れがあるため、これらも監査することが重要です。

source: Below are some guidelines for handling such cases:
ja: いくつか例をあげてみましょう。

source: An open source review board is used to review and approve planned uses of OSS in products for distribution.
ja: オープン ソース調査委員会 (OSRB) は、配布予定の製品における OSS の使用計画を調査および承認すること。

source: A process failure modes effects analysis (FMEA) approach has been used to identify the ways a compliance process can fail and practices to prevent those failures.
ja: また、コンプライアンス プロセスの失敗パターンや、そのような失敗を防ぐためのプラクティスを特定するために、プロセス失敗モード影響解析 (failure modes effects analysis: FMEA) アプローチを使用しています。

source: d)Compliance requests are tracked to closure.
ja: d) コンプライアンス リクエストは、終結するまで追跡される。

source: For Linux distributions packages are typically created in RedHat's RPM or Debian's DEB formats.
ja: Linux ディストリビューション パッケージは、通常、RedHat の RPM 形式か、Debian の DEB 形式で作成されます。

source: - Request FOSS compliance to be completed before a merger or an acquisition
ja: 合併や買収の前に、FOSS コンプライアンスの完了を要求する

source: Scalability
ja: スケーラビリティ

source: Therefore, as a backup, you should also consider setting up a source code control system with a separate folder for FOSS and a notification alert any time there is a check-in to this folder.
ja: したがって、念のため FOSS 専用のフォルダーを持つソース コード管理システムを準備し、このフォルダーにソース コードがチェックインされた時には、必ず警告されるように設定しておくとよいでしょう。

source: Comply with FOSS licensing obligations
ja: FOSS のライセンス義務を順守する

source: - Source code changes in a previously approved component
ja: 以前に承認されたコンポーネントのソース コードが変更された

source: Here you will find in-depth information on open source compliance from noted industry experts.
ja: 業界の著名なエキスパートによるオープン ソース コンプライアンスに関する詳細情報です。

source: We know that none of these approaches is fruitful or beneficial to any of the parties involved.
ja: こうした姿勢は、どれも実りがない、つまりいずれの関係者の利益にもならないものです。

source: Who Should Attend
ja: 対象者

source: Engineering and Product Team Representative
ja: エンジニアリングおよびプロダクト チームの代表者

source: The OSRB works with the OSEC to determine whether the company needs to distribute corresponding source code disclose or take on other obligations such as a patent non-assert, as part of using FOSS.
ja: OSRB は OSEC (オープン ソース実行委員会) と協力し、 FOSS を使用する条件として、対応するソース コードを公開して配布する必要があるか、または非係争特許などの義務を負う必要があるかを判断します。

source: The Linux Foundation has released initial versions of these tools as open source projects and urges other developers to contribute to them.
ja: The Linux Foundationでは、オープン ソース プロジェクトとしてこれらのツールの初期バージョンをリリースし、多くの開発者の参画を呼びかけています。

source: Project Management Tool
ja: プロジェクト管理ツール (Project Management Tool)

source: Review and approval of open source use
ja: オープン ソースを使用するための調査と承認

source: This series of papers aims to increase public awareness of the various issues surrounding FOSS compliance from an operational perspective, and does not aim to provide a legal discussion on the topic.
ja: このホワイト ペーパーのシリーズは、FOSS コンプライアンスを取り巻くさまざまな問題について、一般の認識を高めることを目的としており、FOSS コンプライアンスについて法務的な説明を行うことは目的としていません。

source: Commitment to perform (as evidenced by policy and documented process requirements)
ja: ◆◆履行の強い意志 (ポリシーや文書化されたプロセス要件によって証明される)

source: Linking9 of FOSS into proprietary or 3rd party commercial source code (or vice versa):
ja: プロプライエタリまたはサード パーティの商用ソース コードに FOSS をリンクする (またはその逆)

source: Simply saying your company is doing the right thing is not enough: savvy users want proof to limit the risk of non-compliance with licenses.
ja: つまり、企業は、正しい行動をとるだけでは不十分なのです。経験豊かなユーザーは、ライセンス非順守のリスクを制限するための証明を求めています。

source: - Bradley M. Kuhn, Policy Analyst and IT Director, Software Freedom Law Center (11/09/2009, http://www.softwarefreedom.org/blog/?tag=infringement) }
ja: - Bradley M. Kuhn。Software Freedom Law Center (11/09/2009, http://www.softwarefreedom.org/blog/?tag=infringement) のポリシー アナリスト兼 IT ディレクター。}

source: However, the sections dealing with how secure boot should work are nicely comprehensive and very amenable to use by open platforms.
ja: しかし、secure boot の機能に関するセクションは、包括的でわかりやすく、オープン プラットフォームで利用する際にも大変参考になります。

source: Monitor the FOSS projects
ja: FOSS プロジェクトを監視する

source: In some cases, when the software component in question involves a patent non-assert, the approval is escalated to the OSEC (Open Source Executive Committee).
ja: ただし、対象のソフトウェア コンポーネントに非係争特許が含まれる場合は、承認処理は、OSEC (オープン ソース エグゼクティブ委員会) にエスカレートされます。

source: (3rd Party Commercial / Proprietary)
ja: (サードパーティ商用 / プロプライエタリ)

source: MeeGo Training For Non-Developers
ja: MeeGo Training For Non-Developers (開発者でない人のあめの MeeGo トレーニング)

source: OBS distinguishes, like any good build system, between build dependencies and runtime dependencies.
ja: 優れたビルド システムはどれもそうですが、OBS は、ビルド時の依存関係と実行時の依存関係とを区別しています。

source: Then on the following Wednesday by 08:00 GMT, the QA report is published and the weekly release is announced by 09:00 GMT.
ja: 翌日の水曜日、QA レポートが 08:00 (世界標準時) までに公開され、ウィークリー リリースが 09:00 (世界標準時) までに発表されます。

source: Growth of an internal community of OSS users is encouraged in order to provide organizational guidance and leadership with respect to the use of OSS in an ethical and compliant way.
ja: 社内の OSS 利用者コミュニティの成長を奨励することにより、組織全体が、OSS を正しく利用することの重要性を認識するようにすること。

source: The software component has been approved for usage and it has been registered in the software inventory.
ja: ソフトウェア コンポーネントについて、使用が承認され、ソフトウェア インベントリへの登録が完了している。

source: Once all reviews have been completed, the compliance ticket for a specific software component moves to the approval step (Figure 8).
ja: すべての調査が完了すると、対象のソフトウェア コンポーネントのコンプライアンス チケットは、承認ステップに移動します (図 8)。

source: Embedded Linux Development: A Crash Course
ja: Embedded Linux Development: A Crash Course (組込み Linux 開発: クラッシュ)

source: This topic will be discussed in a future paper.
ja: このテーマについては、今後公開するホワイトペーパーで説明する予定です。

source: Half Day
ja: 半日

source: There are potentially tens of licenses involved
ja: 数十種類のライセンスが関わっている場合もある

source: The end result is companies using free and open source software will all be following the same reporting method.
ja: これにより、OSS を利用する企業はすべて同じレポート方法を使うことになります。

source: Note that this action is helpful to those desiring code download but may not be sufficient by itself to satisfy license obligations.
ja: この作業は、コードをダウンロードしたい人々の便宜をはかるものではありますが、これだけではライセンス義務を満たしていることにはなりません。

source: An example of a written offer that the OSRB would add to the product document would look as follows:
ja: 以下は、OSRBが製品ドキュメントに追加する「書面によるオファー」の例です。

source: If vendors ship their systems in the setup mode and provide a means to add new KEKs to the firmware, those systems will fully support open operating systems while maintaining compliance with the Windows 8 logo requirements.
ja: ベンダーは、setup モードでシステムを出荷し、かつファームウェアに新しい鍵交換鍵を追加する手段を提供すれば、そのシステムは、オープン OS をフルサポートしつつ、Windows 8 ロゴ要件を順守できます。

source: MeeGo supports a magnitude of mobile client devices also called verticals and includes: Handsets, Smart TVs, In-Vehicle Infotainment , Netbooks and Tablets.
ja: MeeGo は、ハンドセット、スマートテレビ、車載インフォテインメント、ネットブック、タブレットなどの◆バーティカルとも呼ばれる◆さまざまなモバイル クライアント デバイスをサポートしています。

source: FOSS compliance best practices
ja: FOSS コンプライアンスのベスト プラクティス

source: c)A compliance inquiry response process exists.
ja: c) コンプライアンス照会対応プロセスが存在する。

source: Take a Class
ja: クラスに参加する

source: Each license carries within it the author’s definition of how the software can be used and re-used.
ja: 各ライセンスは、そのソフトウェアの利用および再利用に関する作成者固有の定義を含んでいます。

source: Any serious software organization sooner or later will have to solve the problem on how to reliably build their software for quality assurance, deployment and delivery.
ja: ソフトウェア組織は、確実な品質保証、デプロイメント、配布を行うために、ソフトウェアのビルド方法に関わる問題を遅かれ早かれ解決しなければなりません。

source: Verification that the packages can be downloaded and uncompressed on an external computer without any errors.
ja: 外部コンピューターで、パッケージをエラーなくダウンロードおよび解凍できることの検証。

source: The compliance team verifies that third party suppliers have made full and accurate disclosure of open source included in their deliverables and that these suppliers have satisfied their obligations under the OSS licenses.
ja: コンプライアンス チームは、サードパーティ サプライヤーが、彼らの提供物に含まれているオープン ソースをすべて正確に開示していること、および、これらのサプライヤーが、OSS ライセンスの下で彼らの義務を履行していることを検証する。

source: A firmware-based mechanism should be established to allow a platform owner to add new key-exchange keys to a system running in secure mode so that dual-boot systems can be set up.
ja: セキュア モードで実行中のシステムにプラットフォーム オーナーが新しい鍵交換鍵を追加してデュアルブート システムを設定できるように、ファームウェアベースのメカニズムを確立する。

source: In this regard, the FSF gives permission to publish translations of the GNU GPL, LGPL, AGPL, and FDL into other languages on two conditions:
ja: この点について、FSF では、次の 2 つの条件を満たす場合に限り、GNU GPL、LGPL、AGPL、および FDL を他言語に翻訳することを認めています。

source: - Contribute to creation and improvement of the compliance program
ja: コンプライアンス プログラムの開発と改良に貢献する

source: Companies achieve complete compliance only through a comprehensive process of audit, disclosure, review, and recordkeeping, not by ad hoc last-minute actions.
ja: 企業は、一時しのぎの作業ではなく、監査 (audit)、開示 (disclosure)、調査 (review)、および記録保持 (recordkeeping) という包括的なプロセスを介すことで、完全なコンプライアンスを履行できます。

source: No scoring scheme has been provided in this initial version of the checklist, although the Open Compliance Program does not preclude such a possibility in the future.
ja: 今回発表される最初のチェックリストは、採点方式にはなっていませんが、今後のオープン コンプライアンス プログラムではそのような方法を取り入れる可能性もあります。

source: A request for accessing source code following a written offer to provide source code licensed under GPL, LGPL and/or other licenses that require making such an offer to the end users
ja: 「ソース コードを提供する」というオファーに従ったソース コード アクセス要求。この対象となるソース コードは、GPL、LGPL、またはその他の「エンド ユーザーにソース コードを提供する旨の書面によるオファーを作成する必要のある」ライセンスの下でライセンスされたソース コードです。

source: Audits assess the extent to which execution of the compliance process produces expected compliance results.
ja: 監査は、コンプライアンス プロセスの実行により、どの程度期待通りのコンプライアンス結果が得られるかを算定する。

source: In fact, many of the steps are the same but just on a smaller scale.
ja: 実際にほとんどの手順は同じですが、少し規模が小さくなります。

source: You can check status of existing requests here.
ja: リクエストの進行状況については、こちらのページで確認できます。

source: There is only one central metadata databse in an OBS deployment.
ja: OBS デプロイメントには中央に 1 つだけメタデータ データベースがあります。

source: Reproduce the entire text of the license agreements for the FOSS code included in the product.
ja: 製品に組み込まれている FOSS コードのライセンス契約書の全文を転載します。

source: - Sign off product release from a compliance perspective
ja: コンプライアンスの観点から見た製品リリースの承認を行う

source: Moblin and Maemo contributors are encouraged to participate at MeeGo.com.
ja: また、Moblin や Maemo のコントリビューターの方は、ぜひ MeeGo.com にご参加ください。

source: - FOSS packages destined for distribution have been identified and approved
ja: 配布予定のすべての FOSS パッケージが識別および承認されていること。

source: It’s had some road testing, but hasn’t been driven by the public, so the group’s focus will shift to driving practical applications and incorporating the inevitable feedback in the next rev.
ja: 実地試験は行いましたが、まだ一般には利用されていません。このため、SPDX ワーキング グループは実用化を推し進め、重要なフィードバックを改訂版に反映させて行きます。

source: Most open source licenses require publishing attribution notices that acknowledge copyright and authorship.
ja: 通常、オープン ソース ライセンスは、著作権情報を通知する帰属告知を行うよう求めています。

source: The most successful way to establish compliance is to incorporate the compliance process and policies, checkpoints and activities as part of the existing software development process.
ja: コンプライアンスの確立に最も効果的な方法は、コンプライアンスのプロセスとポリシー、チェックポイント、およびいろいろな活動を既存のソフトウェア開発プロセスに組み込むことです。

source: A mechanism is used to initiate and plan company contributions of financial support, labor, code, or other intellectual property to community projects.
ja: コミュニティ プロジェクトに対して、企業による財政支援、労働力、コード、あるいはその他の知的財産の貢献を行うメカニズムを用意すること。

source: At a minimum, the policy addresses roles and responsibilities for compliance actions, a review and approval process for use of OSS, guidelines for contributions to community projects and a review and approval process for contributions, and core processes that must be implemented to govern use of OSS in company products.
ja: 少なくとも、そのポリシーは、コンプライアンス作業に関する役割と責任、OSS 利用に関する調査と承認プロセス、コミュニティ プロジェクトへの貢献に関するガイドライン、貢献に関する調査と承認プロセス、および自社製品内の OSS 利用を管理するために実行すべきコア プロセスについて取り上げている。

source: Open Compliance Program
ja: オープン コンプライアンス プログラム

source: Develop FOSS use and distribution policies and procedures
ja: FOSS の利用と配布に関するポリシーおよび手続きを作成する

source: Ensure that the end users of the product know how to locate this information either on the product itself, in the product documentation (user manual or CDROM) and/or on a web site.
ja: 製品自体、または製品のドキュメント (ユーザー マニュアルや CD-ROM) と Web サイトのいずれかまたは両方で、この情報の入手方法について、製品のエンド ユーザーに確実に知らせてください。

source: Building on the now up and running website, we’ll make it easier for anyone to get involved at whatever level they choose: anonymous lurker to engaged worker bee.
ja: 現在運営中の Web サイトには、匿名の閲覧者から熱心な参加者まで、だれでも、またどのようなレベルにも簡単に関わることができます。

source: One of the key obligations of using FOSS is the documentation obligation, also referred to as the
ja: FOSS を利用する上で重要な義務は、ドキュメンテーションの義務、つまり記載義務です。

source: Compliance management, or compliance due diligence, consists of a set of actions that control the intake and distribution of FOSS used in commercial products.
ja: コンプライアンス管理、あるいはコンプライアンス精査は、商品に使用される FOSS の入手および配布を制御する一連の動作で構成されています。

source: An executive sponsor for compliance is a necessity to ensure its success and continuity.
ja: エグゼクティブ層の支援は、コンプライアンスの成功と継続を保証するために不可欠です。
